//////////////////////////////////////////////////////////////////////////
//
// LOGOS: вывод в консоль
//
//////////////////////////////////////////////////////////////////////////

Процедура Вывести(Знач Сообщение) Экспорт
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации[Уровень], , , Сообщение);
	
КонецПроцедуры

Процедура Закрыть() Экспорт

КонецПроцедуры

// Устанавливает свойство аппендера, заданное в конфигурационном файле
//
// Разрешенные свойства: ИмяСобытия, Уровень
//
Процедура УстановитьСвойство(Знач ИмяСвойства, Знач Значение) Экспорт
	Если ИмяСвойства = "ИмяСобытия" Тогда
		ИмяСобытия = Значение;
	ИначеЕсли ИмяСвойства = "Уровень" Тогда
		Уровень = Значение;
	КонецЕсли;
КонецПроцедуры // УстановитьСвойство()

ИмяСобытия = "Логирование";
Уровень = "Предупреждение";